title: MDE - BYOVD/LOL drivers search
id: 123e4567-e89b-12d3-a456-426614174000
status: experimental
description: Search for file-hashes matching LOL drivers in Microsoft Defender for Endpoint (MDE)
references:
    - https://loldrivers.io/
author: William Samuelsson 
date: 2023/05/30
modified: 2023/05/22
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
logsource:
    product:  Microsoft Defender for Endpoint
    category: driver_load
detection: |
  let DriverData = externaldata (
    Id:string,Author:string,Created:string,Command:string,Description1:string,Usecase:string,Category:string,
    Privileges:string,MitreID:string,OperatingSystem:string,Resources:string,Driver:string,Person:string,Handle:string,
    Detection:string,MD5:string,SHA1:string,SHA256:string,KnownVulnerableSamples_Publisher:string,
    KnownVulnerableSamples_Date:string,DriverCompany:string,DriverDescription:string,Verified:string,Tags:string
  ) [@"https://www.loldrivers.io/api/drivers.csv"] 
  with (format="csv", ignoreFirstRecord=true);
  union (
      DriverData
      | join (
          union DeviceFileEvents, DeviceEvents
          | where isnotempty(MD5) and FileName endswith ".sys"
      ) on MD5
  ), (
      DriverData
      | join (
          union DeviceFileEvents, DeviceEvents
          | where isnotempty(SHA1) and FileName endswith ".sys"
      ) on SHA1
  ), (
      DriverData
      | join (
          union DeviceFileEvents, DeviceEvents
          | where isnotempty(SHA256) and FileName endswith ".sys"
      ) on SHA256
  )
falsepositives:
    - Unknown
level: high
