title: Driver Load - driver_4fc254af.sys
id: 6adb7e9b-1927-5528-a7a8-e26fa005a1bb
status: experimental
description: |
    Detects loading of driver driver_4fc254af.sys via hash.
    Sophos, from time to time, has observed a threat actor deploy variants of Poortry on different machines within a single estate during an attack. These variants contain the same payload, but signed with a different certificate than the driver first seen used during the attack.
references:
    - https://www.loldrivers.io/drivers/85335187-dae0-4f06-acea-209efaf74973/
    - https://news.sophos.com/en-us/2024/08/27/burnt-cigar-2/
author: Michael Haag
date: 2024/09/10
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=7cd54df7962a91032a643f152a79cd19'
            - 'SHA1=261f76e625b0bc71a2cbf1e4b451555c2feeb959'
            - 'SHA256=4fc254af8ebfa6fc1050f65c17015b39b36693b58f029c2fa1873976cbca52df'
            - 'IMPHASH=0ca72f969ffaacca4008ae469f9508a4'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
