title: Driver Load - LgDataCatcher.sys
id: 594749d4-dfd6-5b76-af27-4b8ee610d852
status: experimental
description: |
    Detects loading of driver LgDataCatcher.sys via name.
    Confirmed vulnerable driver from Microsoft Block List
references:
    - https://www.loldrivers.io/drivers/5961e133-ccc3-4530-8f4f-5d975c41028d/
    - https://gist.github.com/mgraeber-rc/1bde6a2a83237f17b463d051d32e802c
author: Michael Haag
date: 2023/07/22
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\lgdatacatcher.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
