title: Driver Load - ncpl.sys
id: 23b4d7d0-3d5f-5081-bd9f-faa8b9f325cf
status: experimental
description: |
    Detects loading of driver ncpl.sys via hash.
    ncpl.sys is a vulnerable driver. CVE-2013-3956.
references:
    - https://www.loldrivers.io/drivers/8ff4ab50-05b7-4bfa-b994-1920c4ed4978/
    - https://github.com/jbaines-r7/dellicious
    - https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=a26e600652c33dd054731b4693bf5b01'
            - 'SHA1=bbc1e5fd826961d93b76abd161314cb3592c4436'
            - 'SHA256=6c7120e40fc850e4715058b233f5ad4527d1084a909114fd6a36b7b7573c4a44'
            - 'IMPHASH=8ec78cf864273fd81203678b61c41f04'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
