title: Driver Load - d2.sys
id: 2c7dee8d-4490-5ced-8d84-27373cc7cdb0
status: experimental
description: |
    Detects loading of driver d2.sys via name.
references:
    - https://www.loldrivers.io/drivers/d05a0a6c-c037-4647-99ac-c41593190223/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\d2.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
