title: Driver Load - mtcBSv64.sys
id: 6f2be7bd-7802-5905-bd2a-8fc8566cb87c
status: experimental
description: |
    Detects loading of driver mtcBSv64.sys via name.
    MiTAC System Service Provider
references:
    - https://www.loldrivers.io/drivers/3bc629e8-7bf8-40c2-965b-87eb155e0065/
    - https://github.com/eclypsium/Screwed-Drivers/blob/master/DRIVERS.md
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\mtcbsv64.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
