title: Driver Load - wantd_3.sys
id: 686e6429-930f-511a-94d5-19cf2c0285b9
status: experimental
description: |
    Detects loading of driver wantd_3.sys via name.
    Driver used in the Daxin malware campaign.
references:
    - https://www.loldrivers.io/drivers/a22104a8-126d-449f-ba3e-28678c60c587/
    - https://gist.github.com/MHaggis/9ab3bb795a6018d70fb11fa7c31f8f48
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/daxin-backdoor-espionage
author: Michael Haag
date: 2023/02/28
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\wantd_3.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: medium
