title: Driver Load - driver_82d928c5.sys
id: 7d446fc2-9885-51a2-82a8-178c66e36190
status: experimental
description: |
    Detects loading of driver driver_82d928c5.sys via name.
    Sophos, from time to time, has observed a threat actor deploy variants of Poortry on different machines within a single estate during an attack. These variants contain the same payload, but signed with a different certificate than the driver first seen used during the attack.
references:
    - https://www.loldrivers.io/drivers/af8ef3c0-8686-4112-992b-86587a4a9060/
    - https://news.sophos.com/en-us/2024/08/27/burnt-cigar-2/
author: Michael Haag
date: 2024/09/10
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\driver_82d928c5.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: medium
