title: Driver Load - fidpcidrv.sys
id: 6d103538-aca9-57c3-a60b-482873d52f99
status: experimental
description: |
    Detects loading of driver fidpcidrv.sys via hash.
references:
    - https://www.loldrivers.io/drivers/e6338692-90e0-41b1-9481-a47e0df144ad/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'SHA1=eeff4ec4ebc12c6acd2c930dc2eaaf877cfec7ec'
            - 'SHA1=08596732304351b311970ff96b21f451f23b1e25'
            - 'SHA1=4789b910023a667bee70ff1f1a8f369cffb10fe8'
            - 'SHA1=7838fb56fdab816bc1900a4720eea2fc9972ef7a'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
