title: Driver Load - 4118b86e490aed091b1a219dba45f332.sys
id: 8022baf6-08f7-5100-90d4-e30e2facda02
status: experimental
description: |
    Detects loading of driver 4118b86e490aed091b1a219dba45f332.sys via hash.
    Cisco Talos has identified multiple versions of an undocumented malicious driver named “RedDriver,” a driver-based browser hijacker that uses the Windows Filtering Platform (WFP) to intercept browser traffic. RedDriver has been active since at least 2021. RedDriver utilizes HookSignTool to forge its signature timestamp to bypass Windows driver-signing policies. Code from multiple open-source tools has been used in the development of RedDriver's infection chain, including HP-Socket and a custom implementation of ReflectiveLoader. The authors of RedDriver appear to be skilled in driver development and have deep knowledge of the Windows operating system. This threat appears to target native Chinese speakers, as it searches for Chinese language browsers to hijack. Additionally, the authors are likely Chinese speakers themselves.
references:
    - https://www.loldrivers.io/drivers/b32d8d7d-0dc2-4d09-a306-8efc4caf1839/
    - https://blog.talosintelligence.com/undocumented-reddriver/
author: Alice Climent-Pommeret
date: 2023/07/31
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=4118b86e490aed091b1a219dba45f332'
            - 'SHA1=2929de0b5b5e1ba1cce1908e9d800aa21f448b3d'
            - 'SHA256=0181d60506b1f3609217487c2c737621d637e1232f243f68c662d045f44d4873'
            - 'IMPHASH=be0dd8b8e045356d600ee55a64d9d197'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
