title: Driver Load - tboflhelper.sys
id: 1ec1d5b6-efb4-5822-89a5-6b022c43525c
status: experimental
description: |
    Detects loading of driver tboflhelper.sys via name.
    Northwave Cyber Security contributed this driver based on in-house research. The driver has a CVSSv3 score of 8.8, indicating a privelege escalation impact. This vulnerability could potentially be exploited for privilege escalation or other malicious activities.
references:
    - https://www.loldrivers.io/drivers/07c57c69-c8d7-40cf-8bcc-612671427044/
    - https://northwave-cybersecurity.com/vulnerability-notice-terabyte-image-for-windows?hsLang=en
author: Northwave Cyber Security
date: 2024/09/11
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\tboflhelper.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
