title: Driver Load - driver_77225a99.sys
id: 572a76df-013c-5a02-ae3e-cb9c5070b477
status: experimental
description: |
    Detects loading of driver driver_77225a99.sys via hash.
    Sophos, from time to time, has observed a threat actor deploy variants of Poortry on different machines within a single estate during an attack. These variants contain the same payload, but signed with a different certificate than the driver first seen used during the attack.
references:
    - https://www.loldrivers.io/drivers/5fb86651-c152-404a-9a2f-0f54b0d2bb55/
    - https://news.sophos.com/en-us/2024/08/27/burnt-cigar-2/
author: Michael Haag
date: 2024/09/10
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=41d7ebdb73b4bf2a063ae430e33bc164'
            - 'SHA1=4ebbaa7e0820e453ca82dab25bf8acde4ba87df2'
            - 'SHA256=77225a99b2e0e2b4007fb2f5a96d356e13deab45b9ef54c175d5452de8a211a7'
            - 'IMPHASH=5ea7a944eb3873467dc30aafabea2752'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
