title: Driver Load - fidpcidrv.sys
id: 1c783362-47ce-515d-9521-abcb26111f33
status: experimental
description: |
    Detects loading of driver fidpcidrv.sys via name.
references:
    - https://www.loldrivers.io/drivers/e6338692-90e0-41b1-9481-a47e0df144ad/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\fidpcidrv.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
