title: Driver Load - wantd.sys
id: d4c59c82-7189-5412-872b-ac38c6366028
status: experimental
description: |
    Detects loading of driver wantd.sys via hash.
    Driver used in the Daxin malware campaign.
references:
    - https://www.loldrivers.io/drivers/892292f9-b87c-40a5-80e5-8c9b02914e8b/
    - https://gist.github.com/MHaggis/9ab3bb795a6018d70fb11fa7c31f8f48
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/daxin-backdoor-espionage
author: Michael Haag
date: 2023/02/28
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=b0770094c3c64250167b55e4db850c04'
            - 'SHA1=6abbc3003c7aa69ce79cbbcd2e3210b07f21d202'
            - 'SHA256=06a0ec9a316eb89cb041b1907918e3ad3b03842ec65f004f6fa74d57955573a4'
            - 'IMPHASH=c32d9a9af7f702814e1368c689877f3a'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
