title: Driver Load - nt3.sys
id: 7add46d0-0056-5fe1-ad29-3e2d719dd10a
status: experimental
description: |
    Detects loading of driver nt3.sys via name.
references:
    - https://www.loldrivers.io/drivers/d5118882-6cdd-4b06-8bf4-e9818f16137e/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\nt3.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
