title: Driver Load - PanIO.sys
id: 0202c428-a257-51b2-8926-3d23a29d4a4b
status: experimental
description: |
    Detects loading of driver PanIO.sys via name.
    Temperature and system information driver
references:
    - https://www.loldrivers.io/drivers/5f70bde4-9f81-44a8-9d3e-c6c7cf65bfae/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\panio.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
