title: Driver Load - 1.sys
id: 8ff8bf47-7718-50b3-a430-55238c9d0e55
status: experimental
description: |
    Detects loading of driver 1.sys via hash.
references:
    - https://www.loldrivers.io/drivers/a5792a63-ba77-44ac-bd4a-134b24b01033/
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
author: Michael Haag
date: 2023/01/09
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'SHA256=64f9e664bc6d4b8f5f68616dd50ae819c3e60452efd5e589d6604b9356841b57'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
