title: Driver Load - driver_0ffb4081.sys
id: 713576bb-035b-5cfa-9208-8acb3e9f198b
status: experimental
description: |
    Detects loading of driver driver_0ffb4081.sys via name.
    Sophos, from time to time, has observed a threat actor deploy variants of Poortry on different machines within a single estate during an attack. These variants contain the same payload, but signed with a different certificate than the driver first seen used during the attack.
references:
    - https://www.loldrivers.io/drivers/8081b0d0-e18e-474a-bdfa-8ff1956d90cb/
    - https://news.sophos.com/en-us/2024/08/27/burnt-cigar-2/
author: Michael Haag
date: 2024/09/10
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\driver_0ffb4081.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: medium
