title: Driver Load - 2.sys
id: 0e5fd358-b717-5ce8-a6dd-9683c2c33de0
status: experimental
description: |
    Detects loading of driver 2.sys via name.
    Sophos, from time to time, has observed a threat actor deploy variants of Poortry on different machines within a single estate during an attack. These variants contain the same payload, but signed with a different certificate than the driver first seen used during the attack.
references:
    - https://www.loldrivers.io/drivers/bb1f80f3-d2fd-463e-9403-57c919bd976b/
    - https://news.sophos.com/en-us/2024/08/27/burnt-cigar-2/
author: Michael Haag
date: 2024/09/10
modified: 2026/02/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.malicious
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\2.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: medium
